In [36]:
import pandas as pd
import numpy as np

## DataFrame.where(cond, other=nan, *, inplace=False, axis=None, level=None)
#### cond
###### Replace values where the condition is False.
###### Where cond is True, keep the original value.
###### Where False, replace with corresponding value from other.
###### If cond is callable, it is computed on the Series/DataFrame and should return boolean Series/DataFrame or array. 

#### other
###### Entries where cond is False are replaced with corresponding value from other. 
###### If other is callable, it is computed on the Series/DataFrame and should return scalar or Series/DataFrame. 
###### The callable must not change input Series/DataFrame (though pandas doesn’t check it). 
###### If not specified, entries will be filled with the corresponding NULL value (np.nan for numpy dtypes, pd.NA for extension dtypes).

#### Notes
###### The where method is an application of the if-then idiom. 
###### For each element in the calling DataFrame, if cond is True the element is used; 
###### otherwise the corresponding element from the DataFrame other is used.
###### If the axis of other does not align with axis of cond Series/DataFrame, the misaligned index positions will be filled with False.

## DataFrame.mask(cond, other=<no_default>, *, inplace=False, axis=None, level=None)
#### cond
###### Replace values where the condition is True.
###### Where cond is False, keep the original value.
###### Where True, replace with corresponding value from other.
###### If cond is callable, it is computed on the Series/DataFrame and should return boolean Series/DataFrame or array.

#### other
###### Entries where cond is True are replaced with corresponding value from other.
###### If other is callable, it is computed on the Series/DataFrame and should return scalar or Series/DataFrame.
###### The callable must not change input Series/DataFrame (though pandas doesn’t check it).
###### If not specified, entries will be filled with the corresponding NULL value (np.nan for numpy dtypes, pd.NA for extension dtypes).

#### Notes
###### The mask method is an application of the if-then idiom.
###### For each element in the calling DataFrame, if cond is False the element is used;
###### otherwise the corresponding element from the DataFrame other is used.
###### If the axis of other does not align with axis of cond Series/DataFrame, the misaligned index positions will be filled with True.

### Eg1

In [41]:
s = pd.Series(range(5))
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [42]:
s.where(s > 0)

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

### Eg2

In [55]:
s = pd.Series(range(5))
t = pd.Series([True, False])
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [56]:
t

0     True
1    False
dtype: bool

In [62]:
s.where(t, 99)

0     0
1    99
2    99
3    99
4    99
dtype: int64

In [61]:
s.mask(t, 99)

0    99
1     1
2    99
3    99
4    99
dtype: int64

## Eg3

In [64]:
s.where(s > 1, 10)

0    10
1    10
2     2
3     3
4     4
dtype: int64

In [65]:
s.mask(s > 1, 10)

0     0
1     1
2    10
3    10
4    10
dtype: int64

### Eg4

In [66]:
df = pd.DataFrame(np.arange(10).reshape(-1, 2), columns=['A', 'B'])
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [67]:
m = df % 3 == 0
df.where(m, -df)

   A  B
0  0 -1
1 -2  3
2 -4 -5
3  6 -7
4 -8  9

In [71]:
df.where(m, -df)  == np.where(m, df, -df)

      A     B
0  True  True
1  True  True
2  True  True
3  True  True
4  True  True

In [82]:
df.where(m, -df) == df.mask(~m, -df)

      A     B
0  True  True
1  True  True
2  True  True
3  True  True
4  True  True

In [83]:
df.where(~m, -df) == df.mask(m, -df)

      A     B
0  True  True
1  True  True
2  True  True
3  True  True
4  True  True